
## Plan Result




<pre><code>Plan: 6 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.stored64[&#34;pnc-secret&#34;]
  * azurerm_key_vault_secret.stored64[&#34;scheduler-api-secret&#34;]
  * azurerm_key_vault_secret.stored64[&#34;scheduler-execution&#34;]
  * random_password.generated[&#34;pnc-secret&#34;]
  * random_password.generated[&#34;scheduler-api-secret&#34;]
  * random_password.generated[&#34;scheduler-execution&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.stored64["pnc-secret"] will be created
  + resource "azurerm_key_vault_secret" "stored64" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg"
      + name                    = "pnc-SECRET"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.stored64["scheduler-api-secret"] will be created
  + resource "azurerm_key_vault_secret" "stored64" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg"
      + name                    = "scheduler-api-SECRET"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.stored64["scheduler-execution"] will be created
  + resource "azurerm_key_vault_secret" "stored64" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/juror-stg-rg/providers/Microsoft.KeyVault/vaults/juror-stg"
      + name                    = "job-SERVICE-SECRET"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # random_password.generated["pnc-secret"] will be created
  + resource "random_password" "generated" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 3
      + min_numeric = 3
      + min_special = 0
      + min_upper   = 3
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # random_password.generated["scheduler-api-secret"] will be created
  + resource "random_password" "generated" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 3
      + min_numeric = 3
      + min_special = 0
      + min_upper   = 3
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # random_password.generated["scheduler-execution"] will be created
  + resource "random_password" "generated" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 3
      + min_numeric = 3
      + min_special = 0
      + min_upper   = 3
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":24,"Program":"tfcmt","SHA1":"","Vars":{}} -->